---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SegmentType
source: html/22cc893f-ad98-ea95-a30c-3bf108364dcb.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SegmentType Property

The analytical segment type.

## Syntax (C#)
```csharp
public MEPAnalyticalSegmentType SegmentType { get; }
```